<a href="https://colab.research.google.com/github/lauraemmanuella/IntroducaoPython/blob/main/8_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

* É uma biblioteca escrita sobre numpy
* Permite rápida visualização e limpeza de dados
* Pode trabalhar com dados de tipos diferentes
* Possui métodos próprios de visualização de dados

## Conteúdo

* Séries
* Dataframe
* Dados ausentes
* Groupby
* Concatenar, juntar e mesclar
* Operações
* Entrada e Saída de Dados

## Serie
Uma Serie é muito semelhante a um vetor em NumPy (na verdade, ela é construída em cima do objeto NumPy). O que diferencia um vetor em NumPy de uma Serie, é que uma Serie pode ter rótulos de eixos, o que significa que **pode ser indexado por um rótulo, em vez de apenas uma localização numérica**. Também não precisa manter dados homogêneos, ele **pode conter qualquer objeto Python arbitrário**.

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html

In [ ]:
import pandas as pd

In [ ]:
notas = pd.Series([2,7,5,10,6]) #serie com rotulos default

In [ ]:
notas

0     2
1     7
2     5
3    10
4     6
dtype: int64

In [ ]:
notas.values

array([ 2,  7,  5, 10,  6])

In [ ]:
notas.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
#serie com rotulos definidos
notas = pd.Series([2,7,5,10,5], index=['Wilfred', 'Abbie', 'Harry', 'Julia', 'Carrie'])

In [ ]:
print(notas)

Wilfred     2
Abbie       7
Harry       5
Julia      10
Carrie      5
dtype: int64

In [ ]:
notas['Julia']

10

Outra facilidade proporcionada pela estrutura são seus métodos que fornecem informações estatísticas sobre os valores, como média .mean() e desvio padrão .std()

In [ ]:
print("Média:", notas.mean())
print("Desvio padrão:", notas.std())

Média: 5.8
Desvio padrão: 2.949576240750525

In [ ]:
notas.sort_values()

Wilfred     2
Harry       5
Carrie      5
Abbie       7
Julia      10
dtype: int64

describe() retorna informacoes diferentes dependendo se o tipo eh numerico ou categorico

In [ ]:
notas.describe()

count     5.000000
mean      5.800000
std       2.949576
min       2.000000
25%       5.000000
50%       5.000000
75%       7.000000
max      10.000000
dtype: float64

In [ ]:
notas.max()

10

In [ ]:
notas.min()

2

In [ ]:
notas.value_counts() #conta quantas ocorrencias de cada valor

5     2
7     1
10    1
2     1
dtype: int64

A estrutura é flexível o suficiente pra aplicarmos algumas expressões matemáticas e funções matemáticas do numpy diretamente:

In [ ]:
notas**2

Wilfred      4
Abbie       49
Harry       25
Julia      100
Carrie      25
dtype: int64

In [ ]:
notas

Wilfred     2
Abbie       7
Harry       5
Julia      10
Carrie      5
dtype: int64

Observe que diferente dos arrays numpy, as series podem manter itens com tipos diferentes

In [ ]:
lista = [[1,2], 3.4, 'laura', 5]
lista

[[1, 2], 3.4, 'laura', 5]

In [ ]:
listaserie = pd.Series(lista)
listaserie

0    [1, 2]
1       3.4
2     laura
3         5
dtype: object

In [ ]:
type(listaserie[1])

float

## Dataframe

Já um DataFrame é uma estrutura bidimensional de dados, como uma **planilha**. Podemos pensar em um DataFrame como um conjunto de objetos de Série juntos compartilhando o mesmo índice (linha)

In [ ]:
import numpy as np

In [ ]:
marray = np.random.rand(5,3)*10
print(marray)

[[7.671334   9.8281438  0.46912459]
 [3.17227944 1.19762465 3.93793007]
 [5.39120392 6.13684405 4.28687135]
 [6.01269862 4.3954149  8.6586472 ]
 [8.77840277 9.89583872 2.77377586]]

In [ ]:
# Criando um dataframe aleatorio com indices das linhas e rotulos de colunas default
df0 = pd.DataFrame(marray)

In [ ]:
df0

          0         1         2
0  7.671334  9.828144  0.469125
1  3.172279  1.197625  3.937930
2  5.391204  6.136844  4.286871
3  6.012699  4.395415  8.658647
4  8.778403  9.895839  2.773776

In [ ]:
#Uma coluna
df0[0] #passa o indice ou o rotulo da coluna

0    7.671334
1    3.172279
2    5.391204
3    6.012699
4    8.778403
Name: 0, dtype: float64

In [ ]:
type(df0[0]) #observe que a coluna retornada é uma Serie

pandas.core.series.Series

In [ ]:
#Várias colunas
df0[[0,2]] #passa os indices ou rotulos da coluna separados por virgula dentro de colchetes

          0         2
0  7.671334  0.469125
1  3.172279  3.937930
2  5.391204  4.286871
3  6.012699  8.658647
4  8.778403  2.773776

In [ ]:
#Linha
df0[0:3] #usa a notação com :

          0         1         2
0  7.671334  9.828144  0.469125
1  3.172279  1.197625  3.937930
2  5.391204  6.136844  4.286871

In [ ]:
#Pedaço qualquer
df0[0:2][0] #linhas e colunas

0    7.671334
1    3.172279
Name: 0, dtype: float64

In [ ]:
#Pedaço qualquer
df0[0:3][[0, 2]]

          0         2
0  7.671334  0.469125
1  3.172279  3.937930
2  5.391204  4.286871

In [ ]:
#Colocar rotulos nas colunas
df0.columns = ['N1', 'N2', 'N3']
df0

         N1        N2        N3
0  7.671334  9.828144  0.469125
1  3.172279  1.197625  3.937930
2  5.391204  6.136844  4.286871
3  6.012699  4.395415  8.658647
4  8.778403  9.895839  2.773776

In [ ]:
#Pedaço qualquer
df0[0:2][['N1','N3']] #agora no lugar da coluna nao podemos mais usar os indices default

         N1        N3
0  7.671334  0.469125
1  3.172279  3.937930

In [ ]:
# Colocar rotulos nas linhas
df0.index = ['A1', 'A2', 'A3', 'A4', 'A5']
df0

          N1        N2        N3
A1  7.671334  9.828144  0.469125
A2  3.172279  1.197625  3.937930
A3  5.391204  6.136844  4.286871
A4  6.012699  4.395415  8.658647
A5  8.778403  9.895839  2.773776

**Observe que para a linha, tanto faz usar indice numerico default ou o rotulo do index**

In [ ]:
#Pedaço qualquer
df0[0:2][['N1','N3']] #agora no lugar da coluna nao podemos mais usar os indices default

          N1        N3
A1  7.671334  0.469125
A2  3.172279  3.937930

In [ ]:
#Pedaço qualquer
df0['A1':'A4'][['N1','N3']] #agora no lugar da coluna nao podemos mais usar os indices default

          N1        N3
A1  7.671334  0.469125
A2  3.172279  3.937930
A3  5.391204  4.286871
A4  6.012699  8.658647

**Podemos criar o dataframe direto com rotulos no indice e nas colunas**

In [ ]:
#Criando um dataframe aleatorio indicando os rotulos de indice e colunas
df1 = pd.DataFrame(np.random.rand(5,4),index=['A', 'B', 'C', 'D', 'E'],columns=['W', 'X', 'Y', 'Z'])

In [ ]:
df1

          W         X         Y         Z
A  0.684399  0.980228  0.741629  0.837637
B  0.343281  0.415451  0.760384  0.572263
C  0.762812  0.941156  0.632417  0.583899
D  0.713112  0.805895  0.364477  0.810421
E  0.734582  0.472378  0.986197  0.170638

### loc

Pode-se usar o método loc para localizar linhas ou pedaços do dataframe pelos rótulos

Sintaxe:

loc[linhas, colunas]

Onde as linhas e colunas podem ser passadas em sequencia (:) ou saltos (,)

In [ ]:
df1.loc['A'] #retorna uma Série

W    0.684399
X    0.980228
Y    0.741629
Z    0.837637
Name: A, dtype: float64

In [ ]:
df1.loc[['A']] #retorna um Dataframe

          W         X         Y        Z
A  0.591612  0.735797  0.998409  0.70556

In [ ]:
df1.loc['A', 'W'] #um elemento qualquer [linha, coluna]

0.5916123961802259

In [ ]:
df1.loc['A':'C', 'W':'Y'] #um pedaço qualquer pegando sequencias

          W         X         Y
A  0.591612  0.735797  0.998409
B  0.051410  0.287292  0.785953
C  0.086158  0.092710  0.807022

In [ ]:
df1.loc[['A','C'], ['W','Y']] #um pedaço qualquer com saltos

          W         Y
A  0.591612  0.998409
C  0.086158  0.807022

In [ ]:
df1.loc['A':'C', ['W','Y']] #um pedaço qualquer

          W         Y
A  0.591612  0.998409
B  0.051410  0.785953
C  0.086158  0.807022

### iloc

Pode-se usar o método iloc para localizar linhas ou pedaços do dataframe pelos índices numéricos (posicionais)

Sintaxe (igual a do loc):

iloc[linhas, colunas]

Onde as linhsa e colunas podem usar sequencias (:) ou saltos (,)

A diferença de iloc para loc é que loc usa os rotulos, enquanto iloc usa os indices numericos default

In [ ]:
df1.iloc[0:2, 0:2] #um pedaço qualquer sequencial

          W         X
A  0.591612  0.735797
B  0.051410  0.287292

In [ ]:
df1.iloc[[0,2], [0,2]] #um pedaço qualquer com saltos

          W         Y
A  0.591612  0.998409
C  0.086158  0.807022

**Fazendo alterações**

In [ ]:
df1.iloc[[0,2], [0,2]] = 2019

In [ ]:
df1.loc['A', 'X'] = 99

In [ ]:
df1

             W          X            Y         Z
A  2019.000000  99.000000  2019.000000  0.705560
B     0.051410   0.287292     0.785953  0.360303
C  2019.000000   0.092710  2019.000000  0.626386
D     0.810130   0.494687     0.092987  0.503873
E     0.867313   0.658913     0.611842  0.748493

**Adicionando colunas**

In [ ]:
df1['XY'] = df1['X'] + df1['Y']

In [ ]:
df1

             W            X            Y         Z           XY
A  2019.000000  2118.000000  2019.000000  0.705560  4137.000000
B     0.051410     1.073244     0.785953  0.360303     1.859197
C  2019.000000  2019.092710  2019.000000  0.626386  4038.092710
D     0.810130     0.587673     0.092987  0.503873     0.680660
E     0.867313     1.270756     0.611842  0.748493     1.882598

**Removendo colunas**

In [ ]:
df1.drop('XY', axis=1)

             W            X            Y         Z
A  2019.000000  2118.000000  2019.000000  0.705560
B     0.051410     1.073244     0.785953  0.360303
C  2019.000000  2019.092710  2019.000000  0.626386
D     0.810130     0.587673     0.092987  0.503873
E     0.867313     1.270756     0.611842  0.748493

In [ ]:
df1

             W            X            Y         Z           XY
A  2019.000000  2118.000000  2019.000000  0.705560  4137.000000
B     0.051410     1.073244     0.785953  0.360303     1.859197
C  2019.000000  2019.092710  2019.000000  0.626386  4038.092710
D     0.810130     0.587673     0.092987  0.503873     0.680660
E     0.867313     1.270756     0.611842  0.748493     1.882598

**Para remover permanentemente, use o argumento inplace**

In [ ]:
df1.drop('XY', axis=1, inplace=True)

In [ ]:
df1

             W            X            Y         Z
A  2019.000000  2118.000000  2019.000000  0.705560
B     0.051410     1.073244     0.785953  0.360303
C  2019.000000  2019.092710  2019.000000  0.626386
D     0.810130     0.587673     0.092987  0.503873
E     0.867313     1.270756     0.611842  0.748493

### Leitura de arquivos CSV

In [ ]:
df = pd.read_csv('BaseAlunos.csv') #colocar caminho correto para o arquivo

In [ ]:
df

,Matrícula,Nome,Unid. 1,Unid. 2,Unid. 3,Rec.,Resultado,Faltas,Sit.
0,2020001,ANA SILVA,10.0,4.0,2.0,8.00,7.3,7.0,APR
1,2020002,BRUNO SOUZA,7.0,1.0,4.0,4.00,5.0,1.0,APR
2,2020003,CARLA OLIVEIRA,7.0,0.0,2.0,3.00,4.0,11.0,REP
3,2020004,DAVID ANDRADE,3.0,0.0,5.0,4.00,4.0,17.0,REP
4,2020005,EVELIN MATIAS,8.0,10.0,2.0,4.00,7.3,11.0,APR
5,2020006,FRANCISCO JOSÉ,3.0,8.0,6.0,-,5.7,17.0,APRN
6,2020007,GABRIEL SOARES,10.0,6.0,6.0,-,7.3,0.0,APR
7,2020008,HEITOR NEVES,3.0,10.0,9.0,-,7.3,15.0,APR
8,2020009,INGRID DA SILVA,0.0,5.0,2.0,0.00,2.3,20.0,REMF
9,2020010,JOSÉ MARIA SANTOS,9.0,2.0,0.0,2.00,4.3,17.0,REP

In [ ]:
df.head(3)

,Matrícula,Nome,Unid. 1,Unid. 2,Unid. 3,Rec.,Resultado,Faltas,Sit.
0,2020001,ANA SILVA,10.0,4.0,2.0,8.00,7.3,7.0,APR
1,2020002,BRUNO SOUZA,7.0,1.0,4.0,4.00,5.0,1.0,APR
2,2020003,CARLA OLIVEIRA,7.0,0.0,2.0,3.00,4.0,11.0,REP

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
Matrícula    10 non-null int64
Nome         10 non-null object
Unid. 1      10 non-null float64
Unid. 2      10 non-null float64
Unid. 3      10 non-null float64
Rec.         10 non-null object
Resultado    10 non-null float64
Faltas       10 non-null float64
Sit.         10 non-null object
dtypes: float64(5), int64(1), object(3)
memory usage: 800.0+ bytes

In [ ]:
df.describe()

          Matrícula    Unid. 1    Unid. 2    Unid. 3  Resultado     Faltas
count  1.000000e+01  10.000000  10.000000  10.000000  10.000000  10.000000
mean   2.020006e+06   6.000000   4.600000   3.800000   5.450000  11.600000
std    3.027650e+00   3.496029   3.864367   2.699794   1.807546   6.979335
min    2.020001e+06   0.000000   0.000000   0.000000   2.300000   0.000000
25%    2.020003e+06   3.000000   1.250000   2.000000   4.075000   8.000000
50%    2.020006e+06   7.000000   4.500000   3.000000   5.350000  13.000000
75%    2.020008e+06   8.750000   7.500000   5.750000   7.300000  17.000000
max    2.020010e+06  10.000000  10.000000   9.000000   7.300000  20.000000

In [ ]:
df.describe().drop('Matrícula', axis=1)

         Unid. 1    Unid. 2    Unid. 3  Resultado     Faltas
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean    6.000000   4.600000   3.800000   5.450000  11.600000
std     3.496029   3.864367   2.699794   1.807546   6.979335
min     0.000000   0.000000   0.000000   2.300000   0.000000
25%     3.000000   1.250000   2.000000   4.075000   8.000000
50%     7.000000   4.500000   3.000000   5.350000  13.000000
75%     8.750000   7.500000   5.750000   7.300000  17.000000
max    10.000000  10.000000   9.000000   7.300000  20.000000

In [ ]:
df['Nome'] #retorna uma Serie

0            ANA SILVA
1          BRUNO SOUZA
2       CARLA OLIVEIRA
3        DAVID ANDRADE
4        EVELIN MATIAS
5       FRANCISCO JOSÉ
6       GABRIEL SOARES
7         HEITOR NEVES
8      INGRID DA SILVA
9    JOSÉ MARIA SANTOS
Name: Nome, dtype: object

In [ ]:
df[['Unid. 1']] #retorna um dataframe

   Unid. 1
0     10.0
1      7.0
2      7.0
3      3.0
4      8.0
5      3.0
6     10.0
7      3.0
8      0.0
9      9.0

In [ ]:
df[['Nome','Sit.']]

                Nome  Sit.
0          ANA SILVA   APR
1        BRUNO SOUZA   APR
2     CARLA OLIVEIRA   REP
3      DAVID ANDRADE   REP
4      EVELIN MATIAS   APR
5     FRANCISCO JOSÉ  APRN
6     GABRIEL SOARES   APR
7       HEITOR NEVES   APR
8    INGRID DA SILVA  REMF
9  JOSÉ MARIA SANTOS   REP

In [ ]:
df['Unid. 1'].mean() #media da coluna

6.0

In [ ]:
df['Unid. 1'].std() #desvio padrao da coluna

3.496029493900505

In [ ]:
x = [df['Unid. 1'].mean(), df['Unid. 2'].mean(), df['Unid. 3'].mean()]

In [ ]:
type(x)

list

In [ ]:
print(x)

[6.0, 4.6, 3.8]

In [ ]:
y = df[['Unid. 1','Unid. 2', 'Unid. 3']].mean()

In [ ]:
type(y)

pandas.core.series.Series

In [ ]:
print(y)

Unid. 1    6.0
Unid. 2    4.6
Unid. 3    3.8
dtype: float64

**Criando colunas usando Series**

In [ ]:
df['New'] = pd.Series(['S', 'N', 'S', 'N','S', 'N','S', 'N','S', 'N', 'Y'])

In [ ]:
df

,Matrícula,Nome,Unid. 1,Unid. 2,Unid. 3,Rec.,Resultado,Faltas,Sit.,New
0,2020001,ANA SILVA,10.0,4.0,2.0,8.00,7.3,7.0,APR,S
1,2020002,BRUNO SOUZA,7.0,1.0,4.0,4.00,5.0,1.0,APR,N
2,2020003,CARLA OLIVEIRA,7.0,0.0,2.0,3.00,4.0,11.0,REP,S
3,2020004,DAVID ANDRADE,3.0,0.0,5.0,4.00,4.0,17.0,REP,N
4,2020005,EVELIN MATIAS,8.0,10.0,2.0,4.00,7.3,11.0,APR,S
5,2020006,FRANCISCO JOSÉ,3.0,8.0,6.0,-,5.7,17.0,APRN,N
6,2020007,GABRIEL SOARES,10.0,6.0,6.0,-,7.3,0.0,APR,S
7,2020008,HEITOR NEVES,3.0,10.0,9.0,-,7.3,15.0,APR,N
8,2020009,INGRID DA SILVA,0.0,5.0,2.0,0.00,2.3,20.0,REMF,S
9,2020010,JOSÉ MARIA SANTOS,9.0,2.0,0.0,2.00,4.3,17.0,REP,N

**Transformando uma coluna em indice das linhas**

In [ ]:
df.set_index('Nome', inplace= True)

In [ ]:
df

,Matrícula,Unid. 1,Unid. 2,Unid. 3,Rec.,Resultado,Faltas,Sit.,New
Nome,,,,,,,,,
ANA SILVA,2020001,10.0,4.0,2.0,8.00,7.3,7.0,APR,S
BRUNO SOUZA,2020002,7.0,1.0,4.0,4.00,5.0,1.0,APR,N
CARLA OLIVEIRA,2020003,7.0,0.0,2.0,3.00,4.0,11.0,REP,S
DAVID ANDRADE,2020004,3.0,0.0,5.0,4.00,4.0,17.0,REP,N
EVELIN MATIAS,2020005,8.0,10.0,2.0,4.00,7.3,11.0,APR,S
FRANCISCO JOSÉ,2020006,3.0,8.0,6.0,-,5.7,17.0,APRN,N
GABRIEL SOARES,2020007,10.0,6.0,6.0,-,7.3,0.0,APR,S
HEITOR NEVES,2020008,3.0,10.0,9.0,-,7.3,15.0,APR,N
INGRID DA SILVA,2020009,0.0,5.0,2.0,0.00,2.3,20.0,REMF,S
JOSÉ MARIA SANTOS,2020010,9.0,2.0,0.0,2.00,4.3,17.0,REP,N

In [ ]:
df.loc['ANA SILVA'] # localiza uma linha a partir do novo indice colocado

Matrícula    2020001
Unid. 1           10
Unid. 2            4
Unid. 3            2
Rec.            8.00
Resultado        7.3
Faltas             7
Sit.             APR
New                S
Name: ANA SILVA, dtype: object

## Seleção condicional


Uma característica importante dos pandas é a seleção condicional usando notação de colchetes, muito semelhante ao numpy:

In [ ]:
#Mostrar somente os alunos aprovados
df[df['Sit.'] == 'APR']

,Matrícula,Unid. 1,Unid. 2,Unid. 3,Rec.,Resultado,Faltas,Sit.,New
Nome,,,,,,,,,
ANA SILVA,2020001,10.0,4.0,2.0,8.00,7.3,7.0,APR,S
BRUNO SOUZA,2020002,7.0,1.0,4.0,4.00,5.0,1.0,APR,N
EVELIN MATIAS,2020005,8.0,10.0,2.0,4.00,7.3,11.0,APR,S
GABRIEL SOARES,2020007,10.0,6.0,6.0,-,7.3,0.0,APR,S
HEITOR NEVES,2020008,3.0,10.0,9.0,-,7.3,15.0,APR,N

In [ ]:
#Observe que a seleção condicional faz o mesmo que um Filter faz
df['Sit.'] == 'APR'  #condição do filtro

Nome
ANA SILVA             True
BRUNO SOUZA           True
CARLA OLIVEIRA       False
DAVID ANDRADE        False
EVELIN MATIAS         True
FRANCISCO JOSÉ       False
GABRIEL SOARES        True
HEITOR NEVES          True
INGRID DA SILVA      False
JOSÉ MARIA SANTOS    False
Name: Sit., dtype: bool

Para mais de uma condição usa-se & e | com parênteses

In [ ]:
#mostrar quem foi reprovado
df[(df['Sit.'] == 'REP') | (df['Sit.'] == 'REMF')]

,Matrícula,Unid. 1,Unid. 2,Unid. 3,Rec.,Resultado,Faltas,Sit.,New
Nome,,,,,,,,,
CARLA OLIVEIRA,2020003,7.0,0.0,2.0,3.00,4.0,11.0,REP,S
DAVID ANDRADE,2020004,3.0,0.0,5.0,4.00,4.0,17.0,REP,N
INGRID DA SILVA,2020009,0.0,5.0,2.0,0.00,2.3,20.0,REMF,S
JOSÉ MARIA SANTOS,2020010,9.0,2.0,0.0,2.00,4.3,17.0,REP,N

In [ ]:
#mostrar as faltas de quem foi reprovado
df[(df['Sit.'] == 'REP') | (df['Sit.'] == 'REMF')]['Faltas'] #encadeamento de ações

Nome
CARLA OLIVEIRA       11.0
DAVID ANDRADE        17.0
INGRID DA SILVA      20.0
JOSÉ MARIA SANTOS    17.0
Name: Faltas, dtype: float64

In [ ]:
#mostrar as faltas e resultados de quem foi reprovado
df[(df['Sit.'] == 'REP') | (df['Sit.'] == 'REMF')][['Resultado','Faltas']]

                   Resultado  Faltas
Nome
CARLA OLIVEIRA           4.0    11.0
DAVID ANDRADE            4.0    17.0
INGRID DA SILVA          2.3    20.0
JOSÉ MARIA SANTOS        4.3    17.0

In [ ]:
#mostrar as faltas de quem foi aprovado
df[(df['Sit.'] == 'APR') | (df['Sit.'] == 'APRN')]['Faltas']

Nome
ANA SILVA          7.0
BRUNO SOUZA        1.0
EVELIN MATIAS     11.0
FRANCISCO JOSÉ    17.0
GABRIEL SOARES     0.0
HEITOR NEVES      15.0
Name: Faltas, dtype: float64

In [ ]:
#VERIFICAR A MEDIA DAS FALTAS DE QUEM FOI REPROVADO E DE QUEM FOI APROVADO
mediafaltasrep = df[(df['Sit.'] == 'REP') | (df['Sit.'] == 'REMF')]['Faltas'].mean()
print('Media de faltas de quem foi reprovado: ',mediafaltasrep)
mediafaltasapr = df[(df['Sit.'] == 'APR') | (df['Sit.'] == 'APRN')]['Faltas'].mean()
print('Media de faltas de quem foi aprovado: ', mediafaltasapr)

Media de faltas de quem foi reprovado:  16.25
Media de faltas de quem foi aprovado:  8.5

In [ ]:
#Verificar quem tirou mais de 7 nas 3 unidades
maiorsete = df[(df['Unid. 1']>=7) & (df['Unid. 2']>=7) & (df['Unid. 3']>=7)]
print(maiorsete)

Empty DataFrame
Columns: [Matrícula, Unid. 1, Unid. 2, Unid. 3, Rec., Resultado, Faltas, Sit., New]
Index: []

**Correlação entre colunas**

In [ ]:
df['Unid. 1'].corr(df['Resultado'])  #0.5, fraca correlação positiva

0.5292484090079961

**O que é um coeficiente de correlação?**

O coeficiente de correlação r mede a direção e a força de uma relação linear. 

* Ele sempre tem um valor entre -1 e 1.
* Fortes relações lineares positivas têm valores de r mais próximos de 1.
* Fortes relações lineares negativas têm valores de r mais próximos de -1.
* Relações mais fracas têm valores de r mais próximos de 0.

**Podemos resetar os indices**

In [ ]:
df.reset_index()

,Nome,Matrícula,Unid. 1,Unid. 2,Unid. 3,Rec.,Resultado,Faltas,Sit.,New
0,ANA SILVA,2020001,10.0,4.0,2.0,8.00,7.3,7.0,APR,S
1,BRUNO SOUZA,2020002,7.0,1.0,4.0,4.00,5.0,1.0,APR,N
2,CARLA OLIVEIRA,2020003,7.0,0.0,2.0,3.00,4.0,11.0,REP,S
3,DAVID ANDRADE,2020004,3.0,0.0,5.0,4.00,4.0,17.0,REP,N
4,EVELIN MATIAS,2020005,8.0,10.0,2.0,4.00,7.3,11.0,APR,S
5,FRANCISCO JOSÉ,2020006,3.0,8.0,6.0,-,5.7,17.0,APRN,N
6,GABRIEL SOARES,2020007,10.0,6.0,6.0,-,7.3,0.0,APR,S
7,HEITOR NEVES,2020008,3.0,10.0,9.0,-,7.3,15.0,APR,N
8,INGRID DA SILVA,2020009,0.0,5.0,2.0,0.00,2.3,20.0,REMF,S
9,JOSÉ MARIA SANTOS,2020010,9.0,2.0,0.0,2.00,4.3,17.0,REP,N

### Dados ausentes

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html#pandas.DataFrame.fillna

In [ ]:
#np.nan gera uma marcação de dado ausente
dfna = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [ ]:
dfna

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
dfna.dropna() # mostra as linhas que nao tem dados ausentes

     A    B  C
0  1.0  5.0  1

In [ ]:
dfna.dropna(axis=1) #mostra as colunas que nao tem dados ausentes

   C
0  1
1  2
2  3

In [ ]:
dfna.dropna(thresh=2) #thresh define o mínimo de elementos não NaN

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [ ]:
dfna.fillna(value='-') #preenche os dados ausentes com um value

   A  B  C
0  1  5  1
1  2  -  2
2  -  -  3

In [ ]:
# veja que nem o dropna nem o fillna alteram de fato o dataframe original, eles apenas retornam uma copia alterada
dfna

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

**Para alterar na origem deve colocar o argumento inplace**

In [ ]:
dfna['A'].fillna(value=dfna['A'].mean(), inplace = True) #preenche com a media da coluna

In [ ]:
dfna

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

## Groupby

O método groupby permite agrupar linhas de dados em conjunto e chamar funções agregadas

In [ ]:
# Cria um DataFrame
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [ ]:
type(data)

dict

In [ ]:
dfdata = pd.DataFrame(data)

In [ ]:
dfdata

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [ ]:
dfdata['Salario'] = [1, 2,3, 4,5, 6]

In [ ]:
dfdata

  Empresa     Nome  Venda  Salario
0    GOOG      Sam    200        1
1    GOOG  Charlie    120        2
2    MSFT      Amy    340        3
3    MSFT  Vanessa    124        4
4      FB     Carl    243        5
5      FB    Sarah    350        6

In [ ]:
por_companhia = dfdata.groupby("Empresa")

In [ ]:
por_companhia.mean()

         Venda  Salario
Empresa
FB       296.5      5.5
GOOG     160.0      1.5
MSFT     232.0      3.5

In [ ]:
por_companhia.max()

            Nome  Venda  Salario
Empresa
FB         Sarah    350        6
GOOG         Sam    200        2
MSFT     Vanessa    340        4

In [ ]:
por_companhia.count()

         Nome  Venda  Salario
Empresa
FB          2      2        2
GOOG        2      2        2
MSFT        2      2        2

In [ ]:
por_companhia.describe()

        Salario                                           Venda         \
          count mean       std  min   25%  50%   75%  max count   mean
Empresa
FB          2.0  5.5  0.707107  5.0  5.25  5.5  5.75  6.0   2.0  296.5
GOOG        2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0  160.0
MSFT        2.0  3.5  0.707107  3.0  3.25  3.5  3.75  4.0   2.0  232.0


                std    min     25%    50%     75%    max
Empresa
FB        75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      56.568542  120.0  140.00  160.0  180.00  200.0
MSFT     152.735065  124.0  178.00  232.0  286.00  340.0

In [ ]:
por_companhia.describe().transpose()

Empresa                FB        GOOG        MSFT
Salario count    2.000000    2.000000    2.000000
        mean     5.500000    1.500000    3.500000
        std      0.707107    0.707107    0.707107
        min      5.000000    1.000000    3.000000
        25%      5.250000    1.250000    3.250000
        50%      5.500000    1.500000    3.500000
        75%      5.750000    1.750000    3.750000
        max      6.000000    2.000000    4.000000
Venda   count    2.000000    2.000000    2.000000
        mean   296.500000  160.000000  232.000000
        std     75.660426   56.568542  152.735065
        min    243.000000  120.000000  124.000000
        25%    269.750000  140.000000  178.000000
        50%    296.500000  160.000000  232.000000
        75%    323.250000  180.000000  286.000000
        max    350.000000  200.000000  340.000000

## Mesclar, concatenar e juntar

https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

### CONCATENAR

O método concat, concatena os dados usando os rótulos das colunas como parâmetro unificador

Caso os rótulos das colunas não sejam iguais, ele vai gerar novas colunas e colocar NaN nos espaços novos criados

Pode concatenar os dados usando os indices das linhas como parâmetro unificador, mas nesse caso deve-se colocar o argumento axis=1

**Na concatenação, os dados não são sobrepostos, apenas adicionados**

In [ ]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df_2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df_3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [ ]:
result = pd.concat([df_1, df_2, df_3])

In [ ]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

**Se os índices forem default, podemos criar uma chave para cada dataframe quando concatenamos**

In [ ]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

df_2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']}) 

df_3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']})
result = pd.concat([df_1, df_2, df_3])
print(result)

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [ ]:
result = pd.concat([df_1, df_2, df_3], keys=['k1', 'k2', 'k3'], names = ['Grupo'])
print(result)

           A    B    C    D
Grupo
k1    0   A0   B0   C0   D0
      1   A1   B1   C1   D1
      2   A2   B2   C2   D2
      3   A3   B3   C3   D3
k2    0   A4   B4   C4   D4
      1   A5   B5   C5   D5
      2   A6   B6   C6   D6
      3   A7   B7   C7   D7
k3    0   A8   B8   C8   D8
      1   A9   B9   C9   D9
      2  A10  B10  C10  D10
      3  A11  B11  C11  D11

In [ ]:
result.loc['k1']

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
pd.concat([df_1, df_2, df_3], axis=1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

Observe que o concat não mescla as colunas/linhas que tem o mesmo rótulo

### Mesclar

Permite combinar os dados, sem repetir as colunas/linhas iguais

In [ ]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
esquerda

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [ ]:
direita

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [ ]:
pd.concat([esquerda, direita])

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B    C    D key1 key2
0   A0   B0  NaN  NaN   K0   K0
1   A1   B1  NaN  NaN   K0   K1
2   A2   B2  NaN  NaN   K1   K0
3   A3   B3  NaN  NaN   K2   K1
0  NaN  NaN   C0   D0   K0   K0
1  NaN  NaN   C1   D1   K1   K0
2  NaN  NaN   C2   D2   K1   K0
3  NaN  NaN   C3   D3   K2   K0

In [ ]:
pd.merge(esquerda, direita) # mescla os dados com base nos rotulos das colunas em comum

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

Por padrão, o argumento on são os rótulos iguais das colunas e o argumento how é inner, ou seja, interseção, apenas as chaves iguais aparecerão

In [ ]:
pd.merge(esquerda, direita, how='outer', on=['key1', 'key2']) #une tudo

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [ ]:
pd.merge(esquerda, direita, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [ ]:
pd.merge(esquerda, direita, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

### Join

O alinhamento de dados aqui está nos índices (rótulos de linha). Esse mesmo comportamento pode ser alcançado usando merge mais argumentos adicionais instruindo-o a usar os índices.

Ou seja, faz o mesmo que o merge, mas usando os indices das linhas como parametro de sobreposição

In [ ]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [ ]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [ ]:
esquerda.join(direita, how='inner') #interseção

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [ ]:
esquerda.join(direita, how='outer') #união

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [ ]:
direita.join(esquerda)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

Observe que na concatenação não há sobreposição de dados, ou seja, nenhuma coluna ou linha é omitida, todas serão apresentadas

No Merge e Join existe uma sobreposição de dados, onde as colunas/linhas repetidas só aparecem uma vez

O merge faz o que o join faz, desde que seja configurado. Por padrão, o merge faz a sobreposição dos dados usando rótulos das colunas como chave. Já o Join faz a sobreposição dos dados usando os índices das linhas como chave.

inner = interseção
outer = união

## Mais operações com dataframes

In [ ]:
d_f = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
d_f

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Informação sobre valores exclusivos

In [ ]:
d_f['col2'].unique() #mostra apenas os exclusivos

array([444, 555, 666])

In [ ]:
d_f['col2'].nunique() #quantidade de exclusivos

3

In [ ]:
d_f['col2'].value_counts() #quantidade de cada valor

444    2
555    1
666    1
Name: col2, dtype: int64

### Aplicando funções

In [ ]:
def times2(x):
    return x*2

In [ ]:
d_f['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [ ]:
d_f['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
d_f['col1'].sum()

10

**Removendo colunas permanentemente**

In [ ]:
del d_f['col1']

**Obter nomes de coluna e índice:**

In [ ]:
d_f.columns

Index(['col2', 'col3'], dtype='object')

In [ ]:
d_f.index

RangeIndex(start=0, stop=4, step=1)

**Ordenando um DataFrame**

In [ ]:
d_f

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [ ]:
d_f.sort_values(by='col2', ascending=False) #inplace=False por padrão

   col2 col3
2   666  ghi
1   555  def
0   444  abc
3   444  xyz

**Encontre Valores Nulos ou Verifique Valores Nulos**

In [ ]:
d_f.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

## Saída de dados CSV

In [ ]:
d_f.to_csv('exemplodf.csv',index=False) #colocar caminho correto para o arquivo

## Entrada usando ARFF

In [ ]:
from scipy.io import arff

In [ ]:
data = arff.loadarff('iris.arff') #colocar caminho correto para o arquivo
df = pd.DataFrame(data[0])

In [ ]:
type(data[0])

numpy.ndarray

In [ ]:
df.head()

   sepallength  sepalwidth  petallength  petalwidth           class
0          5.1         3.5          1.4         0.2  b'Iris-setosa'
1          4.9         3.0          1.4         0.2  b'Iris-setosa'
2          4.7         3.2          1.3         0.2  b'Iris-setosa'
3          4.6         3.1          1.5         0.2  b'Iris-setosa'
4          5.0         3.6          1.4         0.2  b'Iris-setosa'